{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "greeting",
    "1": "goodbye",
    "2": "thanks",
    "3": "about",
    "4": "name",
    "5": "Workout Tracker Apps",
    "6": "Personal Training Apps",
    "7": "Yoga Apps",
    "8": "Calorie Counter Apps",
    "9": "Diet Plan Apps",
    "10": "Recipe and Cooking Apps",
    "11": "Stress Management Apps",
    "12": "Diabetes Management Apps",
    "13": "Heart Disease Management Apps",
    "14": "Cancer Management Apps",
    "15": "Menstrual Cycle Tracker Apps",
    "16": "Pregnancy and Childbirth Apps",
    "17": "Sleep Cycle Tracker Apps",
    "18": "Sleep Aid Apps",
    "19": "Prescription Medication Reminder Apps",
    "20": "Virtual Consultation Apps",
    "21": "General Symptom Checker Apps",
    "22": "skin Symptom Checker Apps",
    "23": "neurology symptom checkers",
    "24": "Cancer Diagnosis Apps",
    "25": "Hearing Test Apps"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Calorie Counter Apps": 8,
    "Cancer Diagnosis Apps": 24,
    "Cancer Management Apps": 14,
    "Diabetes Management Apps": 12,
    "Diet Plan Apps": 9,
    "General Symptom Checker Apps": 21,
    "Hearing Test Apps": 25,
    "Heart Disease Management Apps": 13,
    "Menstrual Cycle Tracker Apps": 15,
    "Personal Training Apps": 6,
    "Pregnancy and Childbirth Apps": 16,
    "Prescription Medication Reminder Apps": 19,
    "Recipe and Cooking Apps": 10,
    "Sleep Aid Apps": 18,
    "Sleep Cycle Tracker Apps": 17,
    "Stress Management Apps": 11,
    "Virtual Consultation Apps": 20,
    "Workout Tracker Apps": 5,
    "Yoga Apps": 7,
    "about": 3,
    "goodbye": 1,
    "greeting": 0,
    "name": 4,
    "neurology symptom checkers": 23,
    "skin Symptom Checker Apps": 22,
    "thanks": 2
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.35.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
